In [1]:
import pandas as pd

In [2]:
ser= pd.Series([12,13,17,19])
ser

0    12
1    13
2    17
3    19
dtype: int64

In [3]:
ser[2]

17

In [4]:
ser[0:3]

0    12
1    13
2    17
dtype: int64

In [5]:
ser[[0,3]]

0    12
3    19
dtype: int64

In [6]:
ser.loc[[3,2]]

3    19
2    17
dtype: int64

In [7]:
df= pd.DataFrame({'name':['Pankaj','Gurpreet','Manmeet','Raaju','billa'],'class':['btech','BCA','Mtech','MCA','BA']})

In [8]:
df

       name  class
0    Pankaj  btech
1  Gurpreet    BCA
2   Manmeet  Mtech
3     Raaju    MCA
4     billa     BA

In [9]:
df.loc[:,'total_marks']=100

In [10]:
df

       name  class  total_marks
0    Pankaj  btech          100
1  Gurpreet    BCA          100
2   Manmeet  Mtech          100
3     Raaju    MCA          100
4     billa     BA          100

In [12]:
df.loc[:,'marks']=[34,56,43,23,67]

In [13]:
df

       name  class  total_marks  marks
0    Pankaj  btech          100     34
1  Gurpreet    BCA          100     56
2   Manmeet  Mtech          100     43
3     Raaju    MCA          100     23
4     billa     BA          100     67

In [14]:
df.loc[:,'percentage']= (df.loc[:,'marks']/df.loc[:,'total_marks'])*100

In [15]:
df

       name  class  total_marks  marks  percentage
0    Pankaj  btech          100     34        34.0
1  Gurpreet    BCA          100     56        56.0
2   Manmeet  Mtech          100     43        43.0
3     Raaju    MCA          100     23        23.0
4     billa     BA          100     67        67.0

In [16]:
#rename columns

In [20]:
df.rename(columns={'marks':'numbers'}, inplace=True)  # 'old_name':'new_name'

In [21]:
df

       name  class  total_marks  numbers  percentage
0    Pankaj  btech          100       34        34.0
1  Gurpreet    BCA          100       56        56.0
2   Manmeet  Mtech          100       43        43.0
3     Raaju    MCA          100       23        23.0
4     billa     BA          100       67        67.0

In [22]:
#insert columns

In [23]:
df.insert(2,'address',value='Hoshiarpur')

In [24]:
df

       name  class     address  total_marks  numbers  percentage
0    Pankaj  btech  Hoshiarpur          100       34        34.0
1  Gurpreet    BCA  Hoshiarpur          100       56        56.0
2   Manmeet  Mtech  Hoshiarpur          100       43        43.0
3     Raaju    MCA  Hoshiarpur          100       23        23.0
4     billa     BA  Hoshiarpur          100       67        67.0

In [26]:
df.insert(2,'address',value='Hoshiarpur', allow_duplicates=True)

In [27]:
df

       name  class     address     address  total_marks  numbers  percentage
0    Pankaj  btech  Hoshiarpur  Hoshiarpur          100       34        34.0
1  Gurpreet    BCA  Hoshiarpur  Hoshiarpur          100       56        56.0
2   Manmeet  Mtech  Hoshiarpur  Hoshiarpur          100       43        43.0
3     Raaju    MCA  Hoshiarpur  Hoshiarpur          100       23        23.0
4     billa     BA  Hoshiarpur  Hoshiarpur          100       67        67.0

In [29]:
df.drop('address', axis=1, inplace=True)

In [30]:
df

       name  class  total_marks  numbers  percentage
0    Pankaj  btech          100       34        34.0
1  Gurpreet    BCA          100       56        56.0
2   Manmeet  Mtech          100       43        43.0
3     Raaju    MCA          100       23        23.0
4     billa     BA          100       67        67.0

In [33]:
for i in df:
    print(i)

name
class
total_marks
numbers
percentage

In [34]:
for i in df.iterrows():
    print(i)

(0, name           Pankaj
class           btech
total_marks       100
numbers            34
percentage       34.0
Name: 0, dtype: object)
(1, name           Gurpreet
class               BCA
total_marks         100
numbers              56
percentage         56.0
Name: 1, dtype: object)
(2, name           Manmeet
class            Mtech
total_marks        100
numbers             43
percentage        43.0
Name: 2, dtype: object)
(3, name           Raaju
class            MCA
total_marks      100
numbers           23
percentage      23.0
Name: 3, dtype: object)
(4, name           billa
class             BA
total_marks      100
numbers           67
percentage      67.0
Name: 4, dtype: object)

In [35]:
# conditions

In [36]:
df.loc[:,'numbers']>50

0    False
1     True
2    False
3    False
4     True
Name: numbers, dtype: bool

In [37]:
df[df.loc[:,'numbers']>50]

       name class  total_marks  numbers  percentage
1  Gurpreet   BCA          100       56        56.0
4     billa    BA          100       67        67.0

In [38]:
df

       name  class  total_marks  numbers  percentage
0    Pankaj  btech          100       34        34.0
1  Gurpreet    BCA          100       56        56.0
2   Manmeet  Mtech          100       43        43.0
3     Raaju    MCA          100       23        23.0
4     billa     BA          100       67        67.0

In [41]:
df['class'].value_counts()

class
btech    1
BCA      1
Mtech    1
MCA      1
BA       1
Name: count, dtype: int64

In [43]:
df.describe()

       total_marks   numbers  percentage
count          5.0   5.00000     5.00000
mean         100.0  44.60000    44.60000
std            0.0  17.41551    17.41551
min          100.0  23.00000    23.00000
25%          100.0  34.00000    34.00000
50%          100.0  43.00000    43.00000
75%          100.0  56.00000    56.00000
max          100.0  67.00000    67.00000

In [52]:
df1= pd.DataFrame([15,17,20,25,30,37])

In [53]:
df1.describe()

               0
count   6.000000
mean   24.000000
std     8.390471
min    15.000000
25%    17.750000
50%    22.500000
75%    28.750000
max    37.000000